# EXPLICIT INDEXES

In [1]:
import pandas as pd
import numpy as np

In [2]:
temperature = pd.read_csv('../../temperatures.csv', index_col = 0)
temperature.head()

         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

In [6]:
temperature.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16500 entries, 0 to 16499
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        16500 non-null  object
 1   city        16500 non-null  object
 2   country     16500 non-null  object
 3   avg_temp_c  16407 non-null  float64
dtypes: float64(1), object(3)
memory usage: 644.5+ KB

In [5]:
temperature.describe()

         avg_temp_c
count  16407.000000
mean      19.732877
std        9.579635
min      -23.495000
25%       14.870000
50%       22.119000
75%       27.001500
max       38.283000


### 1.	Setting a column as index:

o	How would you set the date column as the index of the temperature DataFrame?

In [7]:
temp_ind_date = temperature.set_index('date')
temp_ind_date.head()

               city        country  avg_temp_c
date
2000-01-01  Abidjan  Côte D'Ivoire      27.293
2000-02-01  Abidjan  Côte D'Ivoire      27.685
2000-03-01  Abidjan  Côte D'Ivoire      29.061
2000-04-01  Abidjan  Côte D'Ivoire      28.162
2000-05-01  Abidjan  Côte D'Ivoire      27.547

### 2.	Removing index:

o	After setting date as the index, how would you reset it back to a regular column?

In [8]:
print(temp_ind_date.reset_index())

             date     city        country  avg_temp_c
0      2000-01-01  Abidjan  Côte D'Ivoire      27.293
1      2000-02-01  Abidjan  Côte D'Ivoire      27.685
2      2000-03-01  Abidjan  Côte D'Ivoire      29.061
3      2000-04-01  Abidjan  Côte D'Ivoire      28.162
4      2000-05-01  Abidjan  Côte D'Ivoire      27.547
...           ...      ...            ...         ...
16495  2013-05-01     Xian          China      18.979
16496  2013-06-01     Xian          China      23.522
16497  2013-07-01     Xian          China      25.251
16498  2013-08-01     Xian          China      24.528
16499  2013-09-01     Xian          China         NaN

[16500 rows x 4 columns]

### 3.	Dropping index:

o	How can you reset the index to a default integer index and drop the date column completely from the DataFrame?
INDEX SUBSETTINGS

In [9]:
print(temp_ind_date.reset_index(drop=True))

          city        country  avg_temp_c
0      Abidjan  Côte D'Ivoire      27.293
1      Abidjan  Côte D'Ivoire      27.685
2      Abidjan  Côte D'Ivoire      29.061
3      Abidjan  Côte D'Ivoire      28.162
4      Abidjan  Côte D'Ivoire      27.547
...        ...            ...         ...
16495     Xian          China      18.979
16496     Xian          China      23.522
16497     Xian          China      25.251
16498     Xian          China      24.528
16499     Xian          China         NaN

[16500 rows x 3 columns]

### 4.	Index subsettings:

o	Suppose you set city as the index. How would you subset the DataFrame to include only data for 'Abidjan' and 'New York'?

In [10]:
temp_ind_city = temperature.set_index('city')
temp_ind_city.head()

               date        country  avg_temp_c
city
Abidjan  2000-01-01  Côte D'Ivoire      27.293
Abidjan  2000-02-01  Côte D'Ivoire      27.685
Abidjan  2000-03-01  Côte D'Ivoire      29.061
Abidjan  2000-04-01  Côte D'Ivoire      28.162
Abidjan  2000-05-01  Côte D'Ivoire      27.547

In [12]:
temp_ind_city_sub = temp_ind_city.loc[['Abidjan', 'New York']]
temp_ind_city_sub

                date        country  avg_temp_c
city
Abidjan   2000-01-01  Côte D'Ivoire      27.293
Abidjan   2000-02-01  Côte D'Ivoire      27.685
Abidjan   2000-03-01  Côte D'Ivoire      29.061
Abidjan   2000-04-01  Côte D'Ivoire      28.162
Abidjan   2000-05-01  Côte D'Ivoire      27.547
...              ...            ...         ...
New York  2013-05-01  United States      15.544
New York  2013-06-01  United States      20.892
New York  2013-07-01  United States      24.722
New York  2013-08-01  United States      21.001
New York  2013-09-01  United States      17.408

[330 rows x 3 columns]

### 5.	Subsetting on duplicated index values:

o	If city is set as the index, how can you subset all rows where the city is 'Abidjan'?
MULTI-LEVEL INDEXES AKA HIERARCHICAL INDEXES

In [13]:
temp_ind_city.loc['Abidjan']

               date        country  avg_temp_c
city
Abidjan  2000-01-01  Côte D'Ivoire      27.293
Abidjan  2000-02-01  Côte D'Ivoire      27.685
Abidjan  2000-03-01  Côte D'Ivoire      29.061
Abidjan  2000-04-01  Côte D'Ivoire      28.162
Abidjan  2000-05-01  Côte D'Ivoire      27.547
...             ...            ...         ...
Abidjan  2013-05-01  Côte D'Ivoire      27.652
Abidjan  2013-06-01  Côte D'Ivoire      26.157
Abidjan  2013-07-01  Côte D'Ivoire      24.951
Abidjan  2013-08-01  Côte D'Ivoire      24.541
Abidjan  2013-09-01  Côte D'Ivoire         NaN

[165 rows x 3 columns]

### 6.	Multi-level indexes:
o	How would you set a multi-level index with country as the first level and city as the second level?

In [14]:
temp_country_city_ind = temperature.set_index(['country', 'city'])
temp_country_city_ind.head()

                             date  avg_temp_c
country       city
Côte D'Ivoire Abidjan  2000-01-01      27.293
              Abidjan  2000-02-01      27.685
              Abidjan  2000-03-01      29.061
              Abidjan  2000-04-01      28.162
              Abidjan  2000-05-01      27.547

### 7.	Subset outer level with a list:
o	Given the multi-level index from the previous question, how would you subset the DataFrame to include only data for 'Côte D'Ivoire' and 'India'?

In [16]:
temp_country_city_ind.loc[['Côte D\'Ivoire', 'India']]

                             date  avg_temp_c
country       city
Côte D'Ivoire Abidjan  2000-01-01      27.293
              Abidjan  2000-02-01      27.685
              Abidjan  2000-03-01      29.061
              Abidjan  2000-04-01      28.162
              Abidjan  2000-05-01      27.547
...                           ...         ...
India         Surat    2013-05-01      32.980
              Surat    2013-06-01      29.418
              Surat    2013-07-01      27.306
              Surat    2013-08-01      27.187
              Surat    2013-09-01         NaN

[2475 rows x 2 columns]

### 8.	Subset inner level with a list of tuples:
o	How would you subset the DataFrame to include only data for ('Côte D'Ivoire', 'Abidjan') and ('India', 'New Delhi')?
SORTING BY INDEX VALUES

### 9.	Sorting by index values:
o	With the multi-level index set as country and city, how would you sort the DataFrame by these index values?

### 10.	Controlling sorting:
o	How can you sort the DataFrame by country in ascending order and city in descending order?